# IsEmpty Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionGroups..::..IsEmpty Property
DefinitionGroups Class See Also
---
Identifies if the definition groups collection is empty.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsEmpty { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsEmpty As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsEmpty {
	bool get ();
}
```

# See Also
DefinitionGroups Class
Autodesk.Revit.DB Namespace